# -*- coding: utf-8 -*-


table_name = {'data_wind', 'future_exchange','day_kline'}



symbol = ["S5806281", "S5806282", "S5807322", "S5807323", "S5806058",
          "S5808597", "S0116880", "S0068143", "S0029752", "S0164358",
          "S5806052", "S0049507", "S0049493", "S0181392", "S0203259",
          "S0203260", "M0086399", "USE00020"]

table_col = {'data_wind': ["S5806281",
                           "S5806282",
                           "S5807322",
                           "S5807323",
                           "S5806058",
                           "S5808597",
                           "S0116880",
                           "S0068143",
                           "S0029751",
                           "S0029752",
                           "S0164358",
                           "S5806052",
                           "S0049507",
                           "S0049493",
                           "S0181392",
                           "S0203259",
                           "S0203260",
                           "M0086399"],
             'future_bwd_summary': [
                 "USE00006",  # 升贴水:报价:铜:长江有色网
                 "USE00004",  # 升贴水:报价:铜:长江现货
                 "USE00001",  # 升贴水:报价:铜:南储商务网
                 "USE00008"  # 升贴水:报价:铜:LME
             ],
             'spot_stock': [
                 "USE00099"  # 期货:库存:铜:LME
             ],
             'spot_warehouse_receipt': ["USE00105"  # 期货:仓单:铜:LME#
                                        ],
             'data_enanchu': [
                 "ENANCHU_800",  # 上海铜现货升贴水高价
                 "ENANCHU_801"  # 上海铜现货升贴水低价
             ],
             'day_preprocess': [
                 "PE201011",  # 铜连一合约结算价
                 "PE201004"  # 主连持仓量
             ],
             'future_exchange': [
                 "USE00020"  # 外汇:1周汇率:报价:USD
             ],
             'day_kline': [
                 "price_open",
                 "price_high",
                 "price_low",
                 "price_close"
             ]
             # "spot_exchange_detail":[
             #     "USE00043"#外汇:汇率:报价:USD
             # ]
             }

features_list = ["S5806281", "S5806282", "S5807322", "S5807323", "S5806058",
          "S5808597", "S0116880", "S0068143", "S0029752", "S0164358",
          "S5806052", "S0049507", "S0049493", "S0181392", "S0203259",
          "S0203260", "M0086399", "USE00020", "price_open", "price_high",
          "price_low","price_close","d111","d112","d121","d122","d211","d212",
          "d221","d222","d511","d512","d521","d522","time","QA","MA5","MA10","MA15","MA20","EMA5",
          "S0049493_2","S0049493_3","S0049493_4","S0029752_2","S0029752_3","S0029752_4",]

# {'汇率': ("USE00020",
#         "USE00021",
#         "USE00022",
#         "USE00023",
#         "USE00024",
#         "USE00025",
#         "USE00026",
#         "USE00027",
#         "USE00028",
#         "USE00029",
#         "USE00030",
#         "USE00031",
#         "USE00032",
#         "USE00033",
#         "USE00043",
#         "USE00044")}
#
# ("S5807323",#最高溢价:上海电解铜:保税库(仓单)
#             "S5806058",# LME铜升贴水(0-3)
#             "S5807339",#最低溢价:洋山铜
#             "S5807340",#最高溢价:洋山铜
#             # "S5808597",#LME铜升贴水(3-15)
#             "S0116880",#期货结算价(连三):阴极铜
#            # "S0068143",#期货结算价(连续):阴极铜
#             "PE201011",#铜连一合约结算价
#             #"S0029752",# 总库存:LME铜
#             "USE00099",#期货:库存:铜:LME
#            # "S0164358",# LME铜:注册仓单:合计:全球
#             "USE00105",#  期货:仓单:铜:LME
#             "S5806052",# LME铜持仓量
#             "S0049507",#库存小计:阴极铜:总计
#             "S0049493", #库存期货:阴极铜
#             "S0203259", #	1#铜升贴水:最小值:上海金属
#             "S0203260", #	1#铜升贴水:最小值:上海金属
#             "S5806283",#  1#电解铜升贴水:最小值
#             "S5806284",#  1#电解铜升贴水:最大值
#             "USE00006",#  升贴水:报价:铜:长江有色网
#             "USE00004",#  升贴水:报价:铜:长江现货
#             "USE00001",#  升贴水:报价:铜:南储商务网
#             "USE00008",#  升贴水:报价:铜:LME
#             "ENANCHU_800",# 上海铜现货升贴水高价
#             "ENANCHU_801",# 上海铜现货升贴水低价
#             #"P0000001", #   主连持仓量
#             "PE201004",# 主连持仓量
#             #"P0000002"#交割月持仓量
#             "M0086399"#期货持仓量:阴极铜/交割月持仓量
#             )
